---
kind: method
id: M:Autodesk.Revit.DB.GeomCombinationSet.Clear
source: html/c1d20eca-bdf5-a753-bc22-145d6f072652.htm
---
# Autodesk.Revit.DB.GeomCombinationSet.Clear Method

Removes every item GeomCombination the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```